In [1]:
import pandas as pd
import numpy as np
import psycopg2
from sqlalchemy import create_engine
import os

# db const
user='postgres'
password='postgres'
database='postgres'

In [2]:
# Connection to db
engine = create_engine(f'postgresql+psycopg2://{user}:{password}@127.0.0.1:5432/{database}')
conn = engine.connect()

## 1. Create tables in Database

In [3]:
create_query = open('./src/querys/create.sql').read()
conn.execute(create_query)

## 2. Load into SQL Tables

In [7]:
# paths
path_departments = './src/data/departments.csv'
path_jobs = './src/data/jobs.csv'
path_hired_employees = './src/data/hired_employees.csv'

In [8]:
# 1. Load Jobs Table
dtypes = {'id':int, 'job':str}
df_jobs = pd.read_csv(path_jobs,names=[*dtypes.keys()],header=None, dtype=dtypes)
df_jobs.to_sql('jobs',con=conn, if_exists='append' , index=False)

183

In [9]:
# 2. Load Departments Table 
dtypes = {'id':int, 'department':str}
df_department = pd.read_csv(path_departments,names=[*dtypes.keys()],header=None, dtype=dtypes)
df_department.to_sql('departments',con=conn, if_exists='append' , index=False)

12

In [10]:
# 3. Load HiredEmployees Table
columns = ['id','name','datetime','department_id','job_id']
df_hired_employees = pd.read_csv(path_hired_employees,names=columns,header=None)

df_hired_employees.head(2)

   id         name              datetime  department_id  job_id
0   1  Harold Vogt  2021-11-07T02:48:42Z            2.0    96.0
1   2     Ty Hofer  2021-05-30T05:43:46Z            8.0     NaN

In [11]:
# insert only records which exist on jobs table and department table
cond = ( df_hired_employees.department_id.isin(df_department.id.unique()) & df_hired_employees.job_id.isin(df_jobs.id.unique()) )
df_hired_employees_filter = df_hired_employees[cond]


df_hired_employees_filter.to_sql('hired_employees',con=conn, if_exists='append' , index=False)

962

In [12]:
conn.close()

## 3. Create Bkp and Restore Features

### 3.1 Backup Tables

In [21]:
# bkp table
import pandavro as pdx
from datetime import datetime

def create_bkp_table(engine, table_name):
    bkp_path = './src/bkps/bkp_{table_name}_{date}.avro' 
    
    with engine.connect() as conn:
        df = pd.read_sql_table(table_name=table_name,con=conn)
        
    save_path = bkp_path.format(table_name=table_name, date=(datetime.now()).strftime('%Y%m%d') )
    pdx.to_avro(save_path, df)
    pass

# create_bkp_table(engine=engine, table_name='departments')
# create_bkp_table(engine=engine, table_name='jobs')
# create_bkp_table(engine=engine, table_name='hired_employees')

### 3.2 Restore Table Feature

In [ ]:
# restore table

def restore_bkp(engine, table_name, bkp_path):
    df = pdx.read_avro(bkp_path)
    
    with engine.connect() as conn:
        # truncate table
        conn.execute(f'truncate table {table_name}')
        # add
        df.to_sql(table_name,con=conn, if_exists='append' , index=False)
    pass

# restore_bkp(engine=engine, table_name='departments', bkp_path= './src/bkps/bkp_departments_YYYYMMdd.avro')
# restore_bkp(engine=engine, table_name='jobs', bkp_path= './src/bkps/bkp_jobs_YYYYMMdd.avro')
# restore_bkp(engine=engine, table_name='hired_employees', bkp_path= './src/bkps/bkp_hired_employees_YYYYMMdd.avro')

#### Challenge2

In [16]:
# create view first report
try:
    conn = engine.connect()

    reports_query = open('./src/querys/first_report.sql').read()
    conn.execute(reports_query)
finally:
    conn.close()

In [17]:
# conn = engine.connect()
with engine.connect() as conn:
    df_department = pd.read_sql_table(table_name='report1',con=conn)

df_department.head()

   department                            job  Q1  Q2  Q3  Q4
0  Accounting      Account Representative IV   1   0   0   0
1  Accounting                        Actuary   0   1   0   0
2  Accounting             Analyst Programmer   0   0   1   0
3  Accounting  Budget/Accounting Analyst III   0   1   0   0
4  Accounting                Cost Accountant   0   1   0   0

In [18]:
df_department.describe()

               Q1          Q2          Q3          Q4
count  938.000000  938.000000  938.000000  938.000000
mean     0.270789    0.488273    0.486141    0.523454
std      0.496755    0.687106    0.664964    0.711233
min      0.000000    0.000000    0.000000    0.000000
25%      0.000000    0.000000    0.000000    0.000000
50%      0.000000    0.000000    0.000000    0.000000
75%      0.750000    1.000000    1.000000    1.000000
max      4.000000    4.000000    5.000000    5.000000